app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `content`, `blog_id`, `created_at`, `updated_at`) VALUES ('New post', 'New post del blog 1', 1, '2015-05-12 01:33:59', '2015-05-12 01:33:59')
---
  def create
    @post = @blog.posts.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE `posts` SET `content` = 'New post del blog 2', `updated_at` = '2015-05-12 01:39:15' WHERE `posts`.`id` = 1
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
---
    def set_blog
      @blog = Blog.find(params[:blog_id])